import random

dc = {
    "北海道":"新聞紙","青森県": "ストッキング","岩手県": "漆器","宮城県": "硯","秋田県": "カメラ","山形県": "スリッパ",
    "福島県": "キッチンの流し","茨城県": "漢方薬","栃木県": "杉線香",
    "群馬県":"ボールペン",
    "埼玉県":"布団",
    "千葉県":"スナップボタン",
    "東京都":"革靴",
    "神奈川県":"シャンプー",
    "新潟県":"スプーン",
    "富山県":"ファスナー",
    "石川県":"金箔",
    "福井県":"メガネのフレーム",
    "山梨県":"ネクタイ",
    "長野県":"ギター",
    "岐阜県":"包丁",
    "静岡県":"ピアノ",
    "愛知県":"ウール",
    "三重県":"鍵",
    "滋賀県":"扇骨",
    "京都府":"金と銀の糸",
    "大阪府":"爪楊枝",
    "兵庫県":"そろばん",
    "奈良県":"靴下",
    "和歌山県":"ニット",
    "鳥取県":"半紙",
    "島根県":"ノートパソコン",
    "岡山県":"学生服",
    "広島県":"筆",
    "山口県":"大理石",
    "徳島県":"すだち",
    "香川県":"手袋",
    "愛媛県":"タオル",
    "高知県":"自動車",
    "福岡県":"箪笥",
    "佐賀県":"陶磁器",
    "長崎県":"船",
    "熊本県":"畳",
    "大分県":"デジカメ",
    "宮崎県":"血管用カテーテル",
    "鹿児島県":"配合飼料",
    "沖縄県":"黒糖",
      }

key,value = random.choice(list(dc.items()))


a = 1
while a <= 1:
  while a <= 1:
    print("都道府県の名産品クイズを始めます!")
    print("名産品の名前を出すのでどの都道府県のものか当ててください")
    input("準備ができたらエンターキーを押してください")
    print(value)
    input("答えを入力してください")
    if input() == key:
      print("正解!:終了する時は『exit』と入力してください")
    else:
      print("残念、不正解:辞めたい時は『exit』と入力してください")
  if input() == exit:
    break

a += 1